<?php

return [
    'text' => [
        'heading' => [
            'account' => 'Інформація про ваш профіль',
            'register' => 'Реєстрація',
            'login' => 'Вхід в особистий кабінет',
            'reset' => 'Відновлення паролю'
        ],
        'forgotten' => 'Забули пароль?',
        'forgotten_desc' => 'Введіть email, який ви вказали при реєстрації і ми відправимо на нього інформацію по відновленню паролю',
        'or' => 'Або',
        'menu' => [
            'contacts' => 'Контактна інформація',
            'wishlist' => 'Закладки',
            'orders' => 'Історія замовлень',
            'security' => 'Безпека',
            'subscribes' => 'Підписки',
        ],
        'order_id' => 'Номер замовлення',
        'customer' => 'Платник та Отримувач',
        'status' => 'Статус замовлення',
        'total' => 'Загальна вартість',
        'date_added' => 'Дата створення',
        'product_name' => 'Найменування',
        'order_detail' => 'Деталі замовлення',
        'payment' => 'Спосіб оплати',
        'shipping' => 'Спосіб доставки',
        'login_as_user' => 'Ввійти як користувач'
    ],
    'button' => [
        'login' => 'Увійти',
        'forgotten' => 'Відновити',
        'logout' => 'Вийти'
    ],
    'entry' => [
        'firstname' => 'Ім\'я',
        'lastname' => 'Прізвище',
        'login' => 'E-Mail/Телефон',
        'telephone' => 'Телефон',
        'email' => 'E-mail',
        'password' => 'Пароль',
        'confirm' => 'Підтвердіть пароль',
        'newsletter' =>
            [
                'title' => 'Підпиcка',
                'text' => 'Хочу отримувати новини та інформацію про акції'
            ],
    ],
    'error' => [
        'firstname' => 'Ім\'я повинно містити від 2 до 32 символів!',
        'lastname' => 'Прізвище повинно містити від 2 до 32 символів!',
        'password' => 'Пароль повинен містити від 4 до 20 символів!',
        'telephone' => 'Введіть коректний номер телефону',
        'email' => 'Введіть коректну email адресу',
        'confirm' => 'Підтвердження паролю не співпадає!',
        'login-register' => 'Даний логін вже використовується!',
        'empty-wishlist' => 'У вас немає добавлених улюблених продуктів',
        'empty-orders' => 'На цьому акаунті ще нема покупок',
    ],
];