<?php

return [
    'text' => [
        'heading' => [
            'account' => 'Информация о вашем профиле',
            'register' => 'Регистрация',
            'login' => 'Вход в личный кабинет',
        ],
        'forgotten' => 'Забыли пароль?',
        'forgotten_desc' => 'Введите email, который вы указали при регистрации и мы отправим на него информацию по восстановлению пароля',
        'or' => 'Или',
        'menu' => [
            'contacts' => 'Контактная информация',
            'wishlist' => 'Закладки',
            'orders' => 'История заказов',
            'security' => 'Безопасность',
            'subscribes' => 'Подписки',
        ],

        'order_id' => 'Номер заказа',
        'customer' => 'Плательщик и Получатель',
        'status' => 'Статус заказа',
        'total' => 'Общая стоимость',
        'date_added' => 'Дата создания',
        'product_name' => 'Наименование',
        'order_detail' => 'Детали заказа',
        'payment' => 'Способ оплаты',
        'shipping' => 'Способ доставки',
    ],
    'button' => [
        'login' => 'Войти',
        'forgotten' => 'Восстановить',
        'logout' => 'Выйти'
    ],
    'entry' => [
        'firstname' => 'Имя',
        'lastname' => 'Фамилия',
        'login' => 'E-Mail/Телефон',
        'telephone' => 'Телефон',
        'email' => 'E-mail',
        'password' => 'Пароль',
        'confirm' => 'Подтвердите пароль',
        'newsletter' =>
            [
                'title' => 'Подписка',
                'text' => 'Хочу получать новости и информацию об акциях'
            ]
    ],
    'error' => [
        'firstname' => 'Имя должно содержать от 2 до 32 символов!',
        'lastname' => 'Фамилия должна содержать от 2 до 32 символов!',
        'password' => 'Пароль должен содержать от 4 до 20 символов!',
        'telephone' => 'Введите корректный номер телефона',
        'email' => 'Введите корректный email адрес',
        'confirm' => 'Подтверждение пароля не совпадает!',
        'login-register' => 'Данный логин уже используется!',
        'empty-wishlist' => 'У вас нет добавленных любимых продуктов',
        'empty-orders' => 'На этом аккаунте еще нет покупок',
    ],
];